ILLVAN/PSoC_AUDIO_MIDI_project/PSoC_Audio_MIDI/PSoC_Audio_MIDI.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "P00_Vout_aliases.h"
#include "P00_Vout.h"
#include "WaveDAC8_1.h"
#include "Clock_1.h"
#include "UART_1.h"
#include "Pin_Dice_1_aliases.h"
#include "Pin_Dice_1.h"
#include "Pin_Dice_LED_1_aliases.h"
#include "Pin_Dice_LED_1.h"
#include "Pin_Dice_LED_2_aliases.h"
#include "Pin_Dice_LED_2.h"
#include "isr_checkMode.h"
#include "Clock_Mode.h"
#include "Timer_Mode.h"
#include "Pin_Dice_2_aliases.h"
#include "Pin_Dice_2.h"
#include "WaveDAC8_1_Wave1_DMA_dma.h"
#include "WaveDAC8_1_Wave2_DMA_dma.h"
#include "WaveDAC8_1_VDAC8.h"
#include "WaveDAC8_1_BuffAmp.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

